export const NavPaths = [
  {
    name: 'Головна',
    path: '/',
  },
  {
    name: 'Біографія',
    path: '/biography',
  },
  {
    name: 'Галерея',
    path: '/gallery',
  },
  {
    name: 'Творчість',
    path: '/creativity',
  },
  {
    name: 'Тест',
    path: '/test',
  },
  {
    name: 'Інформація',
    path: '/info',
  },
];

export const vasylSymonenkoWorks = [
  {
    title: '" Ти знаєш, що ти — людина? "',
    year: '1960-ті',
    description:
      'Вірш про людську гідність та відповідальність за світ навколо.',
    quote:
      'Ти знаєш, що ти — людина? Ти знаєш про це чи ні? У твоїх руках твоя доля, У твоїх руках вся земля.',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=259',
  },
  {
    title: '" Лебеді материнства "',
    year: '1962',
    description: 'Вірш, присвячений материнській любові та жіночій красі.',
    quote:
      'Лебеді материнства, Ви — вічності крила. Ви — щастя, ви — єдність, Ви — сила, ви — хвала.',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=252',
  },
  {
    title: '" Україна "',
    year: '1961',
    description:
      'Гімн любові до Батьківщини, яка живе в серці кожного українця.',
    quote:
      'Україно, Україно, Серце моє і любов! Ти — надія, ти — єдність, Ти — народів вічний зов.',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=260',
  },
  {
    title: '" У мене Україна одна "',
    year: '1962',
    description:
      'Вірш про єдність українського народу та любов до рідної землі.',
    quote:
      'У мене Україна одна. І в серці, і в пісні одна. І в долі, і в радості одна. І в житті, і в смерті одна.',
    link: 'https://vasylsymonenko.org/statti/u-mene-ukrayina-odna/',
  },
  {
    title: 'Тиша і грім',
    year: 1962,
    description:
      'Перша збірка поезій Симоненка, яка принесла йому широке визнання.',
    quote: 'Тиша — це лише передгрім...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=3671',
  },
  {
    title: 'Земне тяжіння',
    year: 1964,
    description:
      'Збірка поезій, в якій поет розкриває глибокі філософські роздуми про життя та смерть.',
    quote: 'Земля тягне до себе, як мати...',
    link: 'https://booknet.ua/book/zemne-tyazhnnya-b326359',
  },
  {
    title: 'Вино з троянд',
    year: 1965,
    description: 'Збірка новел, в якій Симоненко виявив свій талант прозаїка.',
    quote: 'Вино з троянд — це сльози щастя...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=3658',
  },
  {
    title: 'Цар Плаксій та Лоскотон',
    year: 1963,
    description:
      'Казка для дітей, яка стала класикою української дитячої літератури.',
    quote: 'У царстві Плаксія сміх був заборонений...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=261',
  },
  {
    title: 'Подорож у країну Навпаки',
    year: 1964,
    description:
      'Ще одна відома казка Симоненка, яка вчить дітей добру та справедливості.',
    quote: 'У країні Навпаки все йшло навпаки...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=21967',
  },
  {
    title: 'Грудочка любимої землі',
    year: 1995,
    description: 'Збірка, видана посмертно, яка містить вірші та новели поета.',
    quote: 'Грудочка землі — це все, що лишилося...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=244',
  },
  {
    title: 'Півні на рушниках',
    year: 1992,
    description: 'Збірка, видана посмертно, яка містить вірші та новели поета.',
    quote: 'Півні вишиті на рушниках, як молитва...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=3659',
  },
  {
    title: 'Задивляюсь у твої зіниці',
    year: 1962,
    description:
      'Відомий вірш, в якому Василь Симоненко висловлює свою любов до України.',
    quote: 'Задивляюсь у твої зіниці, як у безодню...',
    link: 'https://www.ukrlib.com.ua/books/printit.php?tid=239',
  },
];

export const vasylSymonenkoQuiz = [
  {
    id: 1,
    question: 'Коли народився Василь Симоненко?',
    options: ['1933', '1935', '1937', '1941'],
    correctAnswer: '1935',
  },
  {
    id: 2,
    question: 'У якій області народився Василь Симоненко?',
    options: ['Львівська', 'Черкаська', 'Київська', 'Полтавська'],
    correctAnswer: 'Черкаська',
  },
  {
    id: 3,
    question: 'Яка збірка Василя Симоненка була опублікована за його життя?',
    options: ['Тиша і грім', 'Земне тяжіння', 'Лебеді материнства', 'Поезії'],
    correctAnswer: 'Тиша і грім',
  },
  {
    id: 4,
    question: 'Яке з цих висловлювань належить Симоненку?',
    options: [
      'Можна все на світі вибирати, сину, вибрати не можна тільки Батьківщину',
      'Любіть Україну, як сонце любіть',
      'Я на світі такий один',
      'О земле втрачена, явися',
    ],
    correctAnswer:
      'Можна все на світі вибирати, сину, вибрати не можна тільки Батьківщину',
  },
  {
    id: 5,
    question: 'Як називається відома поема Василя Симоненка?',
    options: [
      'Господи, гніву пречистого',
      'Лебеді материнства',
      'Дорогою болю',
      'Прапороносці',
    ],
    correctAnswer: 'Лебеді материнства',
  },
  {
    id: 6,
    question: 'До якого покоління українських поетів належав Василь Симоненко?',
    options: [
      'Розстріляне відродження',
      'Шістдесятники',
      'Празька школа',
      'Нова хвиля',
    ],
    correctAnswer: 'Шістдесятники',
  },
  {
    id: 7,
    question: 'Яку освіту здобув Василь Симоненко?',
    options: ['Філологічну', 'Медичну', 'Технічну', 'Юридичну'],
    correctAnswer: 'Філологічну',
  },
  {
    id: 8,
    question: 'Де навчався Василь Симоненко?',
    options: [
      'Київський університет',
      'Львівський університет',
      'Харківський університет',
      'Полтавський педагогічний інститут',
    ],
    correctAnswer: 'Київський університет',
  },
  {
    id: 9,
    question: 'Якою діяльністю займався Василь Симоненко, окрім поезії?',
    options: ['Журналістика', 'Політика', 'Наука', 'Військова справа'],
    correctAnswer: 'Журналістика',
  },
  {
    id: 10,
    question: 'Яка тематика була провідною у творчості Симоненка?',
    options: ['Пейзажна лірика', 'Філософська', 'Громадянська', 'Любовна'],
    correctAnswer: 'Громадянська',
  },
  {
    id: 11,
    question: 'Яке місто стало місцем смерті Василя Симоненка?',
    options: ['Київ', 'Львів', 'Черкаси', 'Полтава'],
    correctAnswer: 'Черкаси',
  },
  {
    id: 12,
    question: 'Як називається вірш Симоненка, присвячений матері?',
    options: [
      'Материнська пісня',
      'Матері',
      'Лебеді материнства',
      'Мамо, вечір догоря',
    ],
    correctAnswer: 'Лебеді материнства',
  },
  {
    id: 13,
    question: 'Яку премію заснували на честь Василя Симоненка?',
    options: ['Шевченківську', 'Симоненківську', 'Гончарівську', 'Франківську'],
    correctAnswer: 'Симоненківську',
  },
  {
    id: 14,
    question: 'Яке з цих понять найбільше характерне для творчості Симоненка?',
    options: ['Патріотизм', 'Романтизм', 'Екзистенціалізм', 'Сентименталізм'],
    correctAnswer: 'Патріотизм',
  },
  {
    id: 15,
    question: "Яка головна ідея поезії 'Ти знаєш, що ти людина'?",
    options: [
      'Соціальна справедливість',
      'Самоцінність людини',
      'Любов до Батьківщини',
      'Мрії про майбутнє',
    ],
    correctAnswer: 'Самоцінність людини',
  },
  {
    id: 16,
    question: 'Що стало причиною ранньої смерті Василя Симоненка?',
    options: ['Хвороба', 'ДТП', 'Арешт', 'Еміграція'],
    correctAnswer: 'Хвороба',
  },
  {
    id: 17,
    question:
      'Хто з цих діячів належав до покоління шістдесятників разом із Симоненком?',
    options: [
      'Павло Тичина',
      'Ліна Костенко',
      'Іван Котляревський',
      'Григорій Сковорода',
    ],
    correctAnswer: 'Ліна Костенко',
  },
  {
    id: 18,
    question: 'Яке видавництво першим опублікувало твори Василя Симоненка?',
    options: ['Смолоскип', 'Дніпро', 'Київська книга', 'Веселка'],
    correctAnswer: 'Дніпро',
  },
  {
    id: 19,
    question: 'Який рік став останнім у житті Василя Симоненка?',
    options: ['1961', '1962', '1963', '1964'],
    correctAnswer: '1963',
  },
];

export const vasylSymonenkoGallery = [
  '/gallery/foto1.jpg',
  '/gallery/foto2.jpg',
  '/gallery/foto3.jpg',
  '/gallery/foto4.jpg',
  '/gallery/foto5.jpg',
  '/gallery/foto6.jpg',
  '/gallery/foto7.jpg',
  '/gallery/foto8.jpg',
  '/gallery/foto9.jpg',
  '/gallery/foto10.jpg',
  '/gallery/foto11.jpg',
  '/gallery/foto12.jpg',
];

export const biographyData = {
  title: 'Василь Симоненко',
  description:
    'Василь Симоненко — один із найвизначніших українських поетів і журналістів XX століття, який став символом українського національного відродження та боротьби за свободу. Його життя, хоча й коротке, залишило глибокий слід у культурі та історії України.',
  sections: [
    {
      title: 'Дитинство і юність',
      content: [
        'Народження: Василь Андрійович Симоненко народився 8 січня 1935 року в селі Біївці (нині Черкаська область) у селянській родині. Його батьки, Андрій і Марія Симоненки, були прості трударі, які прищепили синові любов до рідної землі та української культури.',
        'Навчання: Після закінчення школи Василь вступив до Черкаського педагогічного інституту, а згодом перевівся на факультет журналістики Київського державного університету імені Тараса Шевченка. Саме в університеті він почав активно писати вірші, які швидко привернули увагу однодумців.',
      ],
      image: '/portret5.jpg',
    },
    {
      title: 'Творчий шлях',
      content: [
        'Перші кроки в літературі: У студентські роки Симоненко почав публікувати свої вірші в газетах та журналах. Його творчість відрізнялася глибокою лірикою, філософськими роздумами та громадянською позицією. Вірші «Ти знаєш, що ти — людина?», «Лебеді материнства», «Україна» стали справжніми шедеврами української поезії.',
        'Журналістська діяльність: Після закінчення університету Василь Симоненко працював у газетах «Черкаська правда» та «Молодь України». Його статті часто піднімали гострі соціальні питання, що викликало невдоволення радянської влади.',
      ],
      image: '/portret7.jpg',
    },
    {
      title: 'Громадська діяльність',
      content: [
        'Шістдесятництво: Василь Симоненко був активним учасником українського руху шістдесятників — інтелектуального та культурного руху, який боровся за відродження української мови, культури та національної ідентичності. Разом із іншими діячами, такими як Іван Дзюба, Ліна Костенко та Василь Стус, він став голосом покоління, яке прагнуло свободи.',
        'Переслідування: Діяльність Симоненка викликала невдоволення радянської влади. Його вірші забороняли, а сам поет перебував під постійним наглядом КДБ. Проте він не зрадив своїх ідеалів і продовжував боротися за правду.',
      ],
      image: '/portret3.jpg',
    },
    {
      title: 'Особисте життя',
      content: [
        'Сім’я: Василь Симоненко був одружений із Людмилою Тарасовою, яка стала його музою та опорою. У них народився син Андрій, який пізніше також став журналістом.',
        'Хвороба і смерть: У 1963 році Василь Симоненко захворів на рак. Незважаючи на важку хворобу, він продовжував писати вірші та боротися за свої ідеали. Поет помер 13 грудня 1963 року у віці 28 років. Його поховали в рідному селі Біївці.',
      ],
      image: '/portret6.jpg',
    },
    {
      title: 'Цікаві факти',
      content: [
        'Василь Симоненко писав вірші з дитинства, але його перші публікації з’явилися лише в студентські роки.',
        'Поет був великим шанувальником Тараса Шевченка і часто цитував його у своїх творах.',
        'Багато віршів Симоненка були заборонені радянською цензурою, але вони поширювалися в рукописах серед української інтелігенції.',
      ],
    },
    {
      title: 'Заключення',
      content: [
        'Василь Симоненко — це постать, яка назавжди залишиться в історії України як символ мужності, любові до Батьківщини та віри в свободу. Його слова продовжують надихати мільйони українців у боротьбі за незалежність і справедливість.',
      ],
    },
  ],
};

export const usedResources = [
  'https://uk.wikipedia.org/wiki/Симоненко_Василь_Андрійович',
  'https://dovidka.biz.ua/vasil-simonenko-biografiya-korotko/',
  'https://uinp.gov.ua/istorychnyy-kalendar/sichen/8/1935-narodyvsya-poet-vasyl-symonenko',
  'https://vasylsymonenko.org/foto/',
  'https://suspilne.media/culture/93717-u-mene-ukraina-odna-86-ta-ricnica-z-narodzenna-vasila-simonenka/',
];
